# 1. Сумма трех
# Посчитайте сумму трех введенных целых чисел

# 2. Одинаковая четность
# Даны два целых числа: A, B. 
# Проверить истинность высказывания: "Числа A и B имеют одинаковую четность".

# 3. Четырехзначное?
# Пользователь вводит целое число. 
# Выведите YES, если это число является четырехзначным, и NO в противном случае.

# 6. Описание числа
# Пользователь вводит целое число. 
# Выведите его строку-описание вида "отрицательное четное число", "ноль", 
# "положительное нечетное число", например, 
# численным описанием числа 190 является строка "положительное четное число".

# some_list = [1, '1', True, [1, 2], {1: 2}]
# some_list.append(10)
# some_list.insert(3, 100)

# for el in some_list:
#     print(el)

# some_tuple = (1, 2, 3, 4, 5)
# print(list(some_tuple))
# some_list = list(some_tuple)
# print(id(some_tuple))
# print(id(some_list))

# some_set = {1, 2, 3, 6, 6, 9}
# print(some_set)

# import random

# some_list = [random.randint(1, 50) for _ in range(100)]
# print(40 in some_list)