# 1. Сумма трех
# Посчитайте сумму трех введенных целых чисел

# 2. Одинаковая четность
# Даны два целых числа: A, B. Проверить истинность высказывания: "Числа A и B имеют одинаковую четность".

# 3. Четырехзначное?
# Пользователь вводит целое число. Выведите YES, если это число является четырехзначным, и NO в противном случае.

# 6. Описание числа
# Пользователь вводит целое число. Выведите его строку-описание вида "отрицательное четное число", "ноль", 
# "положительное нечетное число", например, численным описанием числа 190 является строка "положительное четное число".